app/controllers/golfers_controller.rb

	def index
		@golfers = Golfer.all
---
SELECT "golfers".* FROM "golfers"