app/controllers/sessions_controller.rb

  def create
    puts "HELLO IM IN SESSIONS CREATE"
    puts "REQUEST IS #{request.env["omniauth.auth"]}"
    auth = request.env["omniauth.auth"]
    puts "PROVIDER IS #{auth['provider']}"
    puts "UID IS #{auth['uid']}"
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("provider", "uid", "email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["provider", "identity"], ["uid", "4"], ["email", "lyronctk@gmail.com"], ["name", "Lyron Co Ting Keh"], ["created_at", "2016-02-15 03:04:40.364231"], ["updated_at", "2016-02-15 03:04:40.364231"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["provider", "twitter"], ["uid", "3393885111"]]